Revit 2027 API
DWGImportOptions(DWGImportOptions) Constructor
 Constructs a new instance of DWGImportOptions as a copy of the import options.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DWGImportOptions(
	DWGImportOptions option
)
Public Sub New (
	option As DWGImportOptions
)
public:
DWGImportOptions(
	DWGImportOptions^ option
)
new :
        option : DWGImportOptions -> DWGImportOptions
Parameters
option DWGImportOptions
 The options to be copied.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DWGImportOptions Class
DWGImportOptions Overload
Autodesk.Revit.DB Namespace